# ViewSolarstudyStillPresetIndex Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewSolarstudyStillPresetIndex Property
ParameterTypeId Class See Also
---
"Still presets combo"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewSolarstudyStillPresetIndex { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewSolarstudyStillPresetIndex As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewSolarstudyStillPresetIndex {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace